# 雪球网站扩展(xueqiuExt) Chrome插件隐私权政策

生效日期：2024年1月25日

感谢您使用 雪球网站扩展 Chrome 插件（以下简称 “我们” 或 “xueqiuExt”）。我们致力于保护您的隐私和个人数据，并遵守适用的隐私法规。

本隐私权政策旨在向您说明我们收集哪些个人数据，以及如何使用、共享和保护这些数据。

## 1. 收集的个人数据

在使用 xueqiuExt 插件时，我们可能会收集以下类型的个人数据：

- **信息传输：** 当您使用 xueqiuExt 插件时，我们可能会收集和存储您上传到插件中的文件。
- **设备信息：** 我们可能会收集与您的设备相关的信息，如设备类型、操作系统版本和唯一设备标识符。
- **日志信息：** 当您与 xueqiuExt 插件互动时，我们的服务器会自动记录某些信息，包括您的浏览器类型、访问日期和时间、页面浏览次数等。

## 2. 数据使用

我们收集的个人数据将用于以下目的：

- **提供服务：** 我们使用收集的文件数据来执行 xueqiuExt 插件的功能，帮助您对文件进行操作和管理。
- **改进插件：** 我们可能会使用收集的日志信息来分析用户行为，并不断改进和优化 xueqiuExt 插件的功能和性能。
- **安全保障：** 我们可能使用设备信息等数据来确保 xueqiuExt 插件的安全性和完整性。

## 3. 数据共享

我们不会向任何第三方出售、出租或共享您的个人数据，除非获得您的明确同意或法律允许。但在以下情况下，我们可能会与第三方共享数据：

- **服务提供商：** 我们可能与第三方合作伙伴共享数据，以提供 xueqiuExt 插件所需的服务和功能。
- **法律要求：** 如果有合理理由认为需要披露您的个人数据，以遵守适用的法律、法规、法律程序或政府请求，我们可能会披露相关信息。

## 4. 数据保护

我们采取合理的安全措施，保护您的个人数据免受未经授权的访问、使用或泄露。然而，您理解互联网上的数据传输存在风险，我们无法完全保证数据的安全。

## 5. 隐私权政策的更新

我们可能会根据业务需求和法律法规的变化，不时更新本隐私权政策。更新后的隐私权政策将在生效前通过适当方式通知您。

## 6. 联系我们

如果您对本隐私权政策或 xueqiuExt 插件的数据处理有任何疑问或顾虑，请通过以下联系方式与我们取得联系：

<yaoandw@163.com>

请注意，本隐私权政策仅适用于 xueqiuExt Chrome 插件，而非我们网站或其他服务。

谢谢您阅读我们的隐私权政策。希望 xueqiuExt 插件能为您带来愉快的使用体验！
